Revit 2027 API
FailuresAccessor.CommitPendingTransaction Method
 Finishes pending failures processing by committing the pending transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionStatus CommitPendingTransaction()
Public Function CommitPendingTransaction As TransactionStatus
public:
TransactionStatus CommitPendingTransaction()
member CommitPendingTransaction : unit -> TransactionStatus
Return Value
TransactionStatus
 Result of attempt to commit the pending transaction.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing). -or- The processing of the failures is not in the pending state. -or- There is no pending transaction or transaction is not allowed to be committed.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace